#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_command[0]: Refreshing state... [id=5738257688551693195]
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=4247865089283958810]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=1073344346946287230]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6910234484688625973]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 0s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer will be destroyed
  # (because google_cloud_run_service.batch_logs_bq_writer is not in configuration)
  - resource "google_cloud_run_service" "batch_logs_bq_writer" {
      - autogenerate_revision_name = true -> null
      - id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer" -> null
      - location                   = "northamerica-northeast1" -> null
      - name                       = "batch-logs-bq-writer" -> null
      - project                    = "off-net-dev" -> null
      - status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "batch-logs-bq-writer-00002-jxf"
              - latest_ready_revision_name   = "batch-logs-bq-writer-00002-jxf"
              - observed_generation          = 2
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "batch-logs-bq-writer-00002-jxf"
                      - tag             = ""
                      - url             = ""
                    },
                ]
              - url                          = "https://batch-logs-bq-writer-xr5qbdt42a-nn.a.run.app"
            },
        ] -> null

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "58f3bfea-2c31-4b49-bca4-4a50afea815a"
              - "serving.knative.dev/creator"       = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "northamerica-northeast1"
            } -> null
          - generation            = 2 -> null
          - labels                = {} -> null
          - namespace             = "off-net-dev" -> null
          - resource_version      = "AAYR1X/a/hU" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/541105984323/services/batch-logs-bq-writer" -> null
          - terraform_labels      = {} -> null
          - uid                   = "4d0287b2-9127-43f2-83ee-ffbe7a445c00" -> null
        }

      - template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "autoscaling.knative.dev/minScale" = "1"
                  - "client.knative.dev/user-image"    = "gcr.io/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6"
                  - "run.googleapis.com/client-name"   = "cloud-console"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
            }
          - spec {
              - container_concurrency = 80 -> null
              - service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com" -> null
              - timeout_seconds       = 300 -> null

              - containers {
                  - args    = [] -> null
                  - command = [] -> null
                  - image   = "gcr.io/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6" -> null

                  - env {
                      - name  = "project-name" -> null
                      - value = "off-net-dev" -> null
                    }

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "1024Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }
                }
            }
        }

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_eventarc_trigger.gh_logs_trigger will be destroyed
  # (because google_eventarc_trigger.gh_logs_trigger is not in configuration)
  - resource "google_eventarc_trigger" "gh_logs_trigger" {
      - conditions              = {} -> null
      - create_time             = "2024-02-20T19:40:05.347830310Z" -> null
      - effective_labels        = {} -> null
      - event_data_content_type = "application/json" -> null
      - id                      = "projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger" -> null
      - labels                  = {} -> null
      - location                = "northamerica-northeast1" -> null
      - name                    = "gh-logs-trigger" -> null
      - project                 = "off-net-dev" -> null
      - service_account         = "dora-wif@off-net-dev.iam.gserviceaccount.com" -> null
      - terraform_labels        = {} -> null
      - uid                     = "1068ab88-e224-4f56-8442-3496632411b6" -> null
      - update_time             = "2024-02-20T19:40:17.517800939Z" -> null

      - destination {
          - cloud_run_service {
              - path    = "/logs" -> null
              - region  = "northamerica-northeast1" -> null
              - service = "batch-logs-bq-writer" -> null
            }
        }

      - matching_criteria {
          - attribute = "bucket" -> null
          - value     = "off-net-dev-gh-audit-log-archieve-local" -> null
        }
      - matching_criteria {
          - attribute = "type" -> null
          - value     = "google.cloud.storage.object.v1.finalized" -> null
        }

      - transport {
          - pubsub {
              - subscription = "projects/off-net-dev/subscriptions/eventarc-northamerica-northeast1-gh-logs-trigger-sub-891" -> null
              - topic        = "projects/off-net-dev/topics/eventarc-northamerica-northeast1-gh-logs-trigger-134" -> null
            }
        }
    }

  # module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs will be created
  + resource "google_storage_bucket_iam_member" "destination_bucket_access_logs" {
      + bucket = "off-net-dev-gh-audit-log-archieve-local"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:dora-wif@off-net-dev.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs will be created
  + resource "google_storage_bucket_iam_member" "source_bucket_access_logs" {
      + bucket = "off-net-dev-gh-audit-log-station-local"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:dora-wif@off-net-dev.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job will be created
  + resource "google_storage_transfer_job" "batch_logs_transfer_job" {
      + creation_time          = (known after apply)
      + deletion_time          = (known after apply)
      + description            = "This will transfer GitHub LOGS in archive bucket every hour"
      + id                     = (known after apply)
      + last_modification_time = (known after apply)
      + name                   = (known after apply)
      + project                = "off-net-dev"
      + status                 = "ENABLED"

      + schedule {
          + repeat_interval = "3600s"

          + schedule_start_date {
              + day   = 21
              + month = 2
              + year  = 2024
            }
        }

      + transfer_spec {
          + sink_agent_pool_name   = (known after apply)
          + source_agent_pool_name = (known after apply)

          + gcs_data_sink {
              + bucket_name = "off-net-dev-gh-audit-log-archieve-local"
              + path        = (known after apply)
            }

          + gcs_data_source {
              + bucket_name = "off-net-dev-gh-audit-log-station-local"
              + path        = "fourkeys/audit-logs/"
            }
        }
    }

  # module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_command[0] will be destroyed
  # (because null_resource.run_command is not in configuration)
  - resource "null_resource" "run_command" {
      - id       = "5738257688551693195" -> null
      - triggers = {
          - "arguments"             = "5363f6320105f03b07a2b2180ddf3155"
          - "create_cmd_body"       = "builds submit ../batch_logs --tag=gcr.io/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-gh-logs"
          - "create_cmd_entrypoint" = "gcloud"
          - "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
          - "md5"                   = "7f22bf39aaf5ce5980111c3587bef5b5"
        } -> null
    }

  # module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_destroy_command[0] will be destroyed
  # (because null_resource.run_destroy_command is not in configuration)
  - resource "null_resource" "run_destroy_command" {
      - id       = "4247865089283958810" -> null
      - triggers = {
          - "destroy_cmd_body"       = "container images delete gcr.io/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --quiet"
          - "destroy_cmd_entrypoint" = "gcloud"
          - "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> null
    }

Plan: 3 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*